/**
 * Created by xuanmiao on 2017/9/8.
 */
//列表数据
var recruitmentData = {
    //侧栏列表
    list:[
        {
            type: "social",
            name: "社会招聘"
        },
        {
            type: "campus",
            name: "学校招聘"
        }
    ],

    //分类具体信息

    //社会招聘
    social:[
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师1 【社会招聘】 需求人数：1名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师2 【社会招聘】 需求人数：1名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师3 【社会招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师4 【社会招聘】 需求人数：3名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师5 【社会招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师6 【社会招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师7 【社会招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师8 【社会招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师9 【社会招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        }
    ],

    //学校招聘
    campus:[
        {
            id: 1,
            time: '2017-08-13',
            title: '职位要求：前端工程师1 【学校招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 2,
            time: '2017-08-13',
            title: '职位要求：前端工程师2 【学校招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 3,
            time: '2017-08-13',
            title: '职位要求：前端工程师3 【学校招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 4,
            time: '2017-08-13',
            title: '职位要求：前端工程师4 【学校招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 5,
            time: '2017-08-13',
            title: '职位要求：前端工程师5 【学校招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 6,
            time: '2017-08-13',
            title: '职位要求：前端工程师6 【学校招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 7,
            time: '2017-08-13',
            title: '职位要求：前端工程师7 【学校招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        },
        {
            id: 8,
            time: '2017-08-13',
            title: '职位要求：前端工程师8 【学校招聘】 需求人数：2名',
            content: {
                pay: "面议",
                address: "上海",
                exper: "3年以上",
                education: "本科及以上",
                num: "3名",
                requirement: [
                    "1.计算机或相关专业本科以上学历。",
                    "2.从事软件测试工作3年及以上。",
                    "3.具备良好的沟通能力和快速学习能力。",
                    "4.精通测试策略和方法、测试用例设计。",
                    "5.熟悉DB2、AIX等平台的基本操作。",
                    "6.具备2年以上金融IT行业经验，特别是有金融行业相关业务的测试或者开发工作经验者优先。"
                ],
                duty: [
                    "从事计算机软件的测试工作。"
                ]
            }
        }
    ]
};
